asayler/SmartWallv1/slave-pic32/Microchip/Graphics/GDD/Default_Template/Alternative Configurations/HardwareProfile_GFX_PICTAIL_V3_8PMP_PIC32_USB_STK_SSD1926_PH480272T_005_I11Q.h
            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISAbits.TRISA1 = 0
            #define DisplaySetCommand()         LATAbits.LATA1 = 0
            #define DisplaySetData()            LATAbits.LATA1 = 1

            // Definitions for CS pin
            #define DisplayConfig()             TRISBbits.TRISB15 = 0             
            #define DisplayEnable()             LATBbits.LATB15 = 0
            #define DisplayDisable()            LATBbits.LATB15 = 1

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()        TRISAbits.TRISA8 = 0        
            #define DisplayFlashEnable()        LATAbits.LATA8 = 1
            #define DisplayFlashDisable()       LATAbits.LATA8 = 0

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        TRISAbits.TRISA10 = 0
            #define DisplayPowerOn()            LATAbits.LATA10 = 0
            #define DisplayPowerOff()           LATAbits.LATA10 = 1

        #else

            #ifndef __PIC32MX__
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
                #define DisplayResetEnable()        LATCbits.LATC1 = 0
                #define DisplayResetDisable()       LATCbits.LATC1 = 1

	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
                #define DisplaySetCommand()         LATCbits.LATC2 = 0
                #define DisplaySetData()            LATCbits.LATC2 = 1

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDbits.TRISD10 = 0             
                #define DisplayEnable()             LATDbits.LATD10 = 0
                #define DisplayDisable()            LATDbits.LATD10 = 1

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDbits.TRISD1 = 0        
                #define DisplayFlashEnable()        LATDbits.LATD1 = 1
                #define DisplayFlashDisable()       LATDbits.LATD1 = 0

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCbits.TRISC3 = 0
                #define DisplayPowerOn()            LATCbits.LATC3 = 0
                #define DisplayPowerOff()           LATCbits.LATC3 = 1
            #else
            /********
             * PIC32 will use the SET and CLR SFRs for the I/O.
             * These are atomic settings that are recommended when
             * modifying SFRs
             ********/
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
                #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
                #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
                #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
                #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
                #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
                #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDCLR = _TRISD_TRISD1_MASK     
                #define DisplayFlashEnable()        LATDCLR = _LATD_LATD1_MASK
                #define DisplayFlashDisable()       LATDSET = _LATD_LATD1_MASK

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCCLR = _TRISC_TRISC3_MASK
                #define DisplayPowerOn()            LATCCLR = _LATC_LATC3_MASK 
                #define DisplayPowerOff()           LATCSET = _LATC_LATC3_MASK
            #endif

        #endif
    #elif (DISPLAY_CONTROLLER == SSD1906)

            #ifndef __PIC32MX__
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
                #define DisplayResetEnable()        LATCbits.LATC1 = 0
                #define DisplayResetDisable()       LATCbits.LATC1 = 1

	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
                #define DisplaySetCommand()         LATCbits.LATC2 = 0
                #define DisplaySetData()            LATCbits.LATC2 = 1

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDbits.TRISD10 = 0             
                #define DisplayEnable()             LATDbits.LATD10 = 0
                #define DisplayDisable()            LATDbits.LATD10 = 1

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDbits.TRISD1 = 0        
                #define DisplayFlashEnable()        LATDbits.LATD1 = 1
                #define DisplayFlashDisable()       LATDbits.LATD1 = 0

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCbits.TRISC3 = 0
                #define DisplayPowerOn()            LATCbits.LATC3 = 1
                #define DisplayPowerOff()           LATCbits.LATC3 = 0

                // Extended address lines
                #define DisplayAddr0Config()        TRISDbits.TRISD3 = 0
                #define DisplaySetAddr0()           LATDbits.LATD3 = 1
                #define DisplayClearAddr0()         LATDbits.LATD3 = 0

                #define DisplayAddr17Config()       TRISGbits.TRISG14 = 0
                #define DisplaytSetAddr17()         TRISGbits.TRISG14 = 1
                #define DisplayClearAddr17()        TRISGbits.TRISG14 = 0
            #else
            /********
             * PIC32 will use the SET and CLR SFRs for the I/O.
             * These are atomic settings that are recommended when
             * modifying SFRs
             ********/
	            // Definitions for reset pin
                #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
                #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
                #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

